/*
 * Created on 28 May 2011, 2:30 am
 */

#include <stdio.h>
#include <stdlib.h>

/*
 * Να γραφεί πρόγραμμα που δημιουργεί ένα πίνακα Μ στοιχείων τα οποία είναι
 * πραγματικοί μη αρνητικοί αριθμοί, που θεωρούμε ότι αναπαριστούν μετρήσεις
 * μήκους σε εκατοστά (cm). Στη συνέχεια το πρόγραμμα γεμίζει αυτό τον πίνακα
 * διαβάζοντας τιμές από το πληκτρολόγιο. Κατόπιν δημιουργεί ένα άλλο δισδιάστατο
 * πίνακα μεγέθους Μ x 2 στοιχείων. Ζητούμενο είναι η μετατροπή των δεδομένων του
 * πρώτου πίνακα στο αγγλοσαξονικό σύστημα μονάδων που εκφράζεται με πόδια (feet),
 * και ίντσες (inches), λαμβάνοντας υπόψη ότι:
 *
 * Μια ίντσα ισοδυναμεί με 2.54 cm
 * Ένα πόδι αντιστοιχεί σε 12 ίντσες.
 * Το πρόγραμμα μετατρέπει με βάση τις παραπάνω αντιστοιχίες τα δεδομένα του
 * πρώτου πίνακα από cm στο αγγλοσαξονικό σύστημα και στην αντίστοιχη θέση στην
 * πρώτη στήλη του δεύτερου πίνακα, θέτει τον αριθμό των ποδών που προέκυψαν,
 * ενώ στην αντίστοιχη θέση στη δεύτερη στήλη θέτει τον αριθμό των ιντσών.
 *
 * Για παράδειγμα, αν το πρώτο στοιχείο του πρώτου πίνακα είναι 333.3 (δηλαδή το
 * μήκος είναι 333.3 cm που αντιστοιχεί σε 10 πόδια και 11.2 ίντσες), τότε
 * τα αποτελέσματα στις αντίστοιχες θέσεις του δεύτερου πίνακα θα είναι 10
 * (στην πρώτη στήλη) και 11.2 (στη δεύτερη στήλη).
 *
 * Τέλος το πρόγραμμα εμφανίζει στην οθόνη όλα τα στοιχεία των δύο πινάκων
 * στη μορφή:  * 333.3 cm are 10 feet and 11.2 inches

 */

#define N 5

int main(int argc, char** argv) {
    float cmlength[N];
    float aglosax[N][2];
    int i;

    /* Eisagogi stoixeion protoy pinaka */

    for (i = 0; i < N; i++) {
        printf("Enter length %3d in cm\n", i);
        scanf("%f", &cmlength[i]);

        /* Amintikos programmatismos */

        if (cmlength[i] < 0) {
            printf("Error input negative length %7.2f\n", cmlength[i]);
            exit(0);
        }
    }

    /* Ypologismos deyteroy pinaka */

    for (i = 0; i < N; i++) {
        aglosax[i][1] = cmlength[i] / 2.54;
        aglosax[i][0] = (int) aglosax[i][1] / 12;
        if (aglosax[i][0])
            aglosax[i][1] -= aglosax[i][0]*12;

        printf("  %7.2f cm are %5.0f feet and %5.2f inches\n", cmlength[i], aglosax[i][0], aglosax[i][1]);
    }
    printf("\n");
    return (EXIT_SUCCESS);
}
