/*
 * Created on 28 May 2011, 2:30 am
 */

#include <stdio.h>
#include <stdlib.h>

/*
 * Να γραφεί πρόγραμμα που διαβάζει δυο ακέραιους αριθμούς με της εξής σημασία:
 * Ο πρώτος αριθμός αναπαριστά κάποια ώρα της ημέρας με βάση τον 24ωρο συμβολισμό.
 * Για παράδειγμα ο αριθμός 1745 παριστάνει την ώρα 17:45 δηλαδή έξι παρά τέταρτο
 * το απόγευμα, ενώ ο αριθμός 827 παριστάνει την ώρα 08:27, δηλαδή 27 λεπτά μετά
 * της οκτώ το πρωί.
 *
 * Ο δεύτερος αριθμός έχει την ίδια αναπαράσταση, αλλά με λίγο διαφορετική έννοια,
 * μιας και αναφέρεται σε χρονική διάρκεια. Έτσι αν ο δεύτερος αριθμός έχει τη
 * μορφή 335, αυτό σημαίνει χρονικό διάστημα 3:35, δηλαδή τριών ωρών και
 * τριανταπέντε λεπτών της ώρας. Θεωρήστε ότι ο πρώτος αριθμός αναπαριστά την ώρα
 * αναχώρησης ενός δρομολογίου ενός συγκοινωνιακού μέσου (π.χ. ενός τρένου ή ενός
 * αεροπλάνου) και ο δεύτερος χρόνος αναπαριστά τη χρονική διάρκεια του ταξιδιού.
 *
 * Για να έχουν νόημα, και οι δύο αριθμοί είναι μη αρνητικοί και μικρότεροι ή
 * ίσοι του 2400. Με βάση τα παραπάνω, να υλοποιηθεί πρόγραμμα το οποίο διαβάζει
 * τους δυο αυτούς αριθμούς και:
 *
 * 1. Ελέγχει αν πληρούν τους περιορισμούς που αναφέρονται παραπάνω.
 * Αν όχι εμφανίζει στην οθόνη αντίστοιχο μήνυμα λάθους και θα διαβάζει άλλους αριθμούς.
 *
 * 2. Αν οι αριθμοί πληρούν τους δοσμένους περιορισμούς, τότε υπολογίζει και
 * εμφανίζει στην οθόνη το χρόνο περάτωσης του δρομολογίου (δηλαδή την ώρα
 * άφιξης του συγκοινωνιακού μέσου στον προορισμό του).
 *
 * Για παράδειγμα αν η τιμή της μεταβλητής που αντιστοιχεί στο χρόνο αναχώρησης
 * είναι 1415 και η τιμή της μεταβλητής που αντιστοιχεί στη χρονική διάρκεια του
 * ταξιδιού είναι 153, τότε η απάντηση πρέπει να είναι της μορφής «Afiksi stis 16:08».
 * Σε περίπτωση που ο χρόνος αυτός υπερβαίνει τα όρια του 24ώρου να επισημαίνεται
 * ότι αφορά ώρα επόμενης μέρας.  Δηλαδή αν χρόνος αναχώρησης είναι 2118 και η
 * διάρκεια του ταξιδιού 416 να εμφανίζεται σαν απάντηση για το χρόνο άφιξης με
 * τη μορφή «Afiksi stis 01:34 tis epomenis imeras».
 *
 * Στην έξοδο του προγράμματος να ληφθεί υπόψη ότι η αναπαράσταση της ώρας πρέπει
 * να δίνεται με το σωστό τρόπο. Ιδιαίτερα στην περίπτωση που η ώρα ή τα λεπτά της
 * ώρας είναι μονοψήφιοι αριθμοί να εμφανίζονται με πρόθεση του χαρακτήρα «0».
 *
 * Για παράδειγμα η ώρα έξι και 4 λεπτά (το πρωί) να εμφανίζεται ως 06:04.

 */
int main(int argc, char** argv) {
    int depart, duration, arrival;
    int day = 0, hour, min;

    printf("Enter departure time (for 18:56 write 1835) \n"); /* Eisagogi dedomenon */
    scanf("%d", &depart);
    while (depart < 0 || depart >= 2400 || depart % 100 >= 60) { /* Amintikos programmatismos */
        printf("Error input %d\n", depart);
        scanf("%d", &depart);
    }

    printf("Enter duration (for 18:56 write 1835)\n");
    scanf("%d", &duration);
    while (duration < 0 || duration >= 2400 || duration % 100 >= 60) {
        printf("Error input %d\n", duration);
        scanf("%d", &duration);
    }

    hour = depart / 100 + duration / 100; /* Ypologismos athrismatos oron */
    min = depart % 100 + duration % 100; /* Ypologismos athroismatos lepton */

    if (min >= 60) /* Elegxos an to athroisma ton lepton einai pano apo 60 */ {
        min -= 60;
        hour++;
    }

    if (hour >= 24) /* Elegxos an to athroisma ton oron einai pano apo 24 */ {
        day = 1;
        hour = hour - 24;
    }

    /* Ektiposeis */

    printf(" Departure time %2.2d:%2.2d\n", depart / 100, depart % 100);
    printf(" Duration time %2.2d:%2.2d\n", duration / 100, duration % 100);
    if (day)
        printf(" Arrival time %2.2d:%2.2d next day\n", hour, min);
    else
        printf(" Arrival time %2.2d:%2.2d\n", hour, min);

    printf("\n");
    return (EXIT_SUCCESS);
}
